#include <stdio.h>

//9.0
//1001.0
//(-1)^0 * 1.001 *2^3
//(-1)^s * M     *2^E
//s - 0
//M - 1.001
//E - 3
//float 存储结构  1位符号位s+8位指数位E+23位数值位
//double 存储结构 1位符号位s+11位指数位E+44位数值位
//E 8位时，存储值为实际值+127
//E 11位时，存储值为实际值+1023
//5.5
//0101.1
//(-1)^0 * 1.011 *2^2
//0 10000001 01100000000000000000000
//E 存储值全为0时，实际值为1-127 表示无穷接近于0
//E 存储值全为1时，表示+-无穷大
int main()
{
	int n=9;
	//000000000000000000000000000001001
	float *pf=(float *)&n;
	printf("%d\n",n);
	printf("%f\n",*pf);
	//0 00000000 000000000000000000001001
	//0

	*pf=9.0;
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000000
	printf("%d\n",n);
	//2^30+2^24+2^20
	printf("%f\n",*pf);
	//9.000000
	return 0;
}
